Revit 2027 API
BuiltInFailures.LoadFailures.CannotRotateLoad Property
 Can't rotate Load because rotation axis is not perpendicular to sketch plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotRotateLoad { get; }
Public Shared ReadOnly Property CannotRotateLoad As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotRotateLoad {
	FailureDefinitionId^ get ();
}
static member CannotRotateLoad : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace